7767517
90 100
Input                    in0                      0 1 in0
Input                    in1                      0 1 in1
Split                    splitncnn_0              1 2 in1 2 3
Convolution              convrelu_0               1 1 in0 4 0=48 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=1296 9=1
ConvolutionDepthWise     convdwrelu_0             1 1 4 5 0=48 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=432 7=48 9=1
Convolution              convrelu_1               1 1 5 6 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304 9=1
ConvolutionDepthWise     convdwrelu_1             1 1 6 7 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=432 7=48 9=1
Convolution              convrelu_2               1 1 7 8 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304 9=1
ConvolutionDepthWise     convdwrelu_2             1 1 8 9 0=48 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=432 7=48 9=1
Convolution              convrelu_3               1 1 9 10 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6144 9=1
ConvolutionDepthWise     convdwrelu_3             1 1 10 11 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128 9=1
Convolution              convrelu_4               1 1 11 12 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=1
ConvolutionDepthWise     convdwrelu_4             1 1 12 13 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128 9=1
Convolution              convrelu_5               1 1 13 14 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=1
ConvolutionDepthWise     convdwrelu_5             1 1 14 15 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128 9=1
Convolution              convrelu_6               1 1 15 16 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=1
ConvolutionDepthWise     convdwrelu_6             1 1 16 17 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128 9=1
Convolution              convrelu_7               1 1 17 18 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=1
ConvolutionDepthWise     convdwrelu_7             1 1 18 19 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128 9=1
Convolution              convrelu_8               1 1 19 20 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=1
ConvolutionDepthWise     convdwrelu_8             1 1 20 21 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128 9=1
Convolution              convrelu_9               1 1 21 22 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=1
ConvolutionDepthWise     convdwrelu_9             1 1 22 23 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128 9=1
Convolution              convrelu_10              1 1 23 24 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=1
ConvolutionDepthWise     convdwrelu_10            1 1 24 25 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=1152 7=128 9=1
Convolution              convrelu_11              1 1 25 26 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768 9=1
ConvolutionDepthWise     convdwrelu_11            1 1 26 27 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256 9=1
Convolution              convrelu_12              1 1 27 28 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536 9=1
ConvolutionDepthWise     convdwrelu_12            1 1 28 29 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256 9=1
Convolution              convrelu_13              1 1 29 30 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536 9=1
ConvolutionDepthWise     convdwrelu_13            1 1 30 31 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256 9=1
Convolution              convrelu_14              1 1 31 32 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536 9=1
ConvolutionDepthWise     convdwrelu_14            1 1 32 33 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256 9=1
Convolution              convrelu_15              1 1 33 34 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536 9=1
ConvolutionDepthWise     convdwrelu_15            1 1 34 35 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256 9=1
Convolution              convrelu_16              1 1 35 36 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536 9=1
ConvolutionDepthWise     convdwrelu_16            1 1 36 37 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256 9=1
Convolution              convrelu_17              1 1 37 38 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536 9=1
ConvolutionDepthWise     convdwrelu_17            1 1 38 39 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256 9=1
Convolution              convrelu_18              1 1 39 40 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536 9=1
ConvolutionDepthWise     convdwrelu_18            1 1 40 41 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256 9=1
Convolution              convrelu_19              1 1 41 42 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536 9=1
ConvolutionDepthWise     convdwrelu_19            1 1 42 43 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256 9=1
Convolution              convrelu_20              1 1 43 44 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536 9=1
Split                    splitncnn_1              1 2 44 45 46
Convolution              convrelu_21              1 1 46 47 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=294912 9=1
Split                    splitncnn_2              1 2 47 48 49
Convolution              convrelu_22              1 1 49 50 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=147456 9=1
Split                    splitncnn_3              1 2 50 51 52
Convolution              convrelu_23              1 1 52 53 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=147456 9=1
Split                    splitncnn_4              1 2 53 54 55
Convolution              convrelu_24              1 1 55 56 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=147456 9=1
Concat                   cat_0                    2 1 56 2 57 0=0
Convolution              convrelu_25              1 1 57 58 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=294912 9=1
Deconvolution            deconv_46                1 1 58 59 0=128 1=2 11=2 12=1 13=2 14=0 18=0 19=0 2=1 3=2 4=0 5=1 6=65536
Deconvolution            deconv_47                1 1 3 60 0=128 1=2 11=2 12=1 13=2 14=0 18=0 19=0 2=1 3=2 4=0 5=1 6=65536
Split                    splitncnn_5              1 2 60 61 62
Concat                   cat_1                    3 1 59 54 61 63 0=0
Convolution              convrelu_26              1 1 63 64 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=442368 9=1
Deconvolution            deconv_48                1 1 64 65 0=128 1=2 11=2 12=1 13=2 14=0 18=0 19=0 2=1 3=2 4=0 5=1 6=65536
Deconvolution            deconv_49                1 1 62 66 0=128 1=2 11=2 12=1 13=2 14=0 18=0 19=0 2=1 3=2 4=0 5=1 6=65536
Split                    splitncnn_6              1 2 66 67 68
Concat                   cat_2                    3 1 65 51 67 69 0=0
Convolution              convrelu_27              1 1 69 70 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=442368 9=1
Deconvolution            deconv_50                1 1 70 71 0=128 1=2 11=2 12=1 13=2 14=0 18=0 19=0 2=1 3=2 4=0 5=1 6=65536
Deconvolution            deconv_51                1 1 68 72 0=128 1=2 11=2 12=1 13=2 14=0 18=0 19=0 2=1 3=2 4=0 5=1 6=65536
Split                    splitncnn_7              1 2 72 73 74
Concat                   cat_3                    3 1 71 48 73 75 0=0
Convolution              convrelu_28              1 1 75 76 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=442368 9=1
Deconvolution            deconv_52                1 1 76 77 0=128 1=2 11=2 12=1 13=2 14=0 18=0 19=0 2=1 3=2 4=0 5=1 6=65536
Deconvolution            deconv_53                1 1 74 78 0=128 1=2 11=2 12=1 13=2 14=0 18=0 19=0 2=1 3=2 4=0 5=1 6=65536
Concat                   cat_4                    3 1 77 45 78 79 0=0
Convolution              convrelu_29              1 1 79 80 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=294912 9=1
Convolution              conv_30                  1 1 80 81 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Split                    splitncnn_8              1 3 81 82 83 84
Convolution              convrelu_30              1 1 84 85 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=1
Convolution              convrelu_31              1 1 85 86 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432 9=1
Convolution              convrelu_32              1 1 86 87 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608 9=1
Convolution              convrelu_33              1 1 87 88 0=8 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 9=1
Convolution              convrelu_34              1 1 83 89 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=1
Convolution              convrelu_35              1 1 89 90 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432 9=1
Convolution              convrelu_36              1 1 90 91 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608 9=1
Convolution              convrelu_37              1 1 91 92 0=8 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 9=1
Convolution              conv_40                  1 1 92 out2 0=2 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16
Convolution              convrelu_38              1 1 82 94 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=1
Convolution              convrelu_39              1 1 94 95 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432 9=1
Convolution              convrelu_40              1 1 95 96 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608 9=1
Convolution              convrelu_41              1 1 96 97 0=8 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 9=1
Convolution              convsigmoid_42           1 1 88 out0 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8 9=4
Convolution              convsigmoid_43           1 1 97 out1 0=2 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16 9=4
