7767517
45 45
Input                    in0                      0 1 in0
Convolution              convrelu_0               1 1 in0 1 0=48 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=1296 9=1
ConvolutionDepthWise     convdwrelu_0             1 1 1 2 0=48 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=432 7=48 9=1
Convolution              convrelu_1               1 1 2 3 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304 9=1
ConvolutionDepthWise     convdwrelu_1             1 1 3 4 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=432 7=48 9=1
Convolution              convrelu_2               1 1 4 5 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304 9=1
ConvolutionDepthWise     convdwrelu_2             1 1 5 6 0=48 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=432 7=48 9=1
Convolution              convrelu_3               1 1 6 7 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6144 9=1
ConvolutionDepthWise     convdwrelu_3             1 1 7 8 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128 9=1
Convolution              convrelu_4               1 1 8 9 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=1
ConvolutionDepthWise     convdwrelu_4             1 1 9 10 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128 9=1
Convolution              convrelu_5               1 1 10 11 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=1
ConvolutionDepthWise     convdwrelu_5             1 1 11 12 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128 9=1
Convolution              convrelu_6               1 1 12 13 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=1
ConvolutionDepthWise     convdwrelu_6             1 1 13 14 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128 9=1
Convolution              convrelu_7               1 1 14 15 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=1
ConvolutionDepthWise     convdwrelu_7             1 1 15 16 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128 9=1
Convolution              convrelu_8               1 1 16 17 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=1
ConvolutionDepthWise     convdwrelu_8             1 1 17 18 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128 9=1
Convolution              convrelu_9               1 1 18 19 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=1
ConvolutionDepthWise     convdwrelu_9             1 1 19 20 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128 9=1
Convolution              convrelu_10              1 1 20 21 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=1
ConvolutionDepthWise     convdwrelu_10            1 1 21 22 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=1152 7=128 9=1
Convolution              convrelu_11              1 1 22 23 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768 9=1
ConvolutionDepthWise     convdwrelu_11            1 1 23 24 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256 9=1
Convolution              convrelu_12              1 1 24 25 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536 9=1
ConvolutionDepthWise     convdwrelu_12            1 1 25 26 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256 9=1
Convolution              convrelu_13              1 1 26 27 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536 9=1
ConvolutionDepthWise     convdwrelu_13            1 1 27 28 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256 9=1
Convolution              convrelu_14              1 1 28 29 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536 9=1
ConvolutionDepthWise     convdwrelu_14            1 1 29 30 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256 9=1
Convolution              convrelu_15              1 1 30 31 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536 9=1
ConvolutionDepthWise     convdwrelu_15            1 1 31 32 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256 9=1
Convolution              convrelu_16              1 1 32 33 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536 9=1
ConvolutionDepthWise     convdwrelu_16            1 1 33 34 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256 9=1
Convolution              convrelu_17              1 1 34 35 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536 9=1
ConvolutionDepthWise     convdwrelu_17            1 1 35 36 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256 9=1
Convolution              convrelu_18              1 1 36 37 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536 9=1
ConvolutionDepthWise     convdwrelu_18            1 1 37 38 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256 9=1
Convolution              convrelu_19              1 1 38 39 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536 9=1
ConvolutionDepthWise     convdwrelu_19            1 1 39 40 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256 9=1
Convolution              convrelu_20              1 1 40 41 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536 9=1
Convolution              convrelu_21              1 1 41 42 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=294912 9=1
Convolution              convrelu_22              1 1 42 43 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=147456 9=1
Convolution              convrelu_23              1 1 43 out0 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=147456 9=1
